#pragma once
#include "../Headers/FrameParameters.h"
#include "../Models/DetectResultSegment.hpp"
#include <core/core.hpp>
#include "../Detector/Detector.hpp"
#include "../Monitor/Monitor.hpp"
#include "../Models/FrameDataRingBufferStruct.hpp"
#include "../Models/DetectResultRingBufferStruct.hpp"

/****************************************************************************************/
/* 其他参数定义                                                                          */
/****************************************************************************************/
extern unsigned char FrameData[FRAME_DATA_SIZE];         // 每一帧图像临时缓冲
extern unsigned short FrameDataInprocessing[IMAGE_SIZE]; // 每一帧图像临时缓冲
extern unsigned short FrameDataToShow[IMAGE_SIZE];       // 每一帧显示结果图像临时缓冲
extern DetectResultSegment ResultItemSendToServer;       // 每一帧图像检测结果
extern const int ResultItemSize;                         // 每一帧图像检测结果大小
extern cv::Mat CVFrame;

/****************************************************************************************/
/* 检测器定义                                                                          */
/****************************************************************************************/
extern Detector* detector;  // 初始化检测器
extern Monitor* monitor;     // 初始化Monitor

/****************************************************************************************/
/* 参数定义：缓冲区全局变量声明与定义                                                      */
/****************************************************************************************/
extern const int BufferSize;                           // 线程同步缓冲区大小
extern FrameDataRingBufferStruct Buffer;               // 数据接收线程环形缓冲区初始化
extern DetectResultRingBufferStruct ResultBuffer;      // 结果发送线程环形缓冲区初始化

/****************************************************************************************/
/* 函数定义：显示结果（测试用）                                                           */
/****************************************************************************************/
void ShowLastResult(int shouLastResultDelay);

/****************************************************************************************/
/* 函数定义：释放指针                                                                    */
/****************************************************************************************/
inline void RelaseSource();

/****************************************************************************************/
/* 函数定义：从网络读取数据操作（读取一帧）                                                 */
/****************************************************************************************/
bool InputDataToBuffer(FrameDataRingBufferStruct* buffer);

/****************************************************************************************/
/* 函数定义：检测一帧数据，并且把结果放在缓冲区                                             */
/****************************************************************************************/
bool DetectTarget(FrameDataRingBufferStruct* buffer, DetectResultRingBufferStruct* resultBuffer);

/****************************************************************************************/
/* 函数定义：发送一帧检测结果                                                             */
/****************************************************************************************/
bool OutputData(DetectResultRingBufferStruct* buffer);

/****************************************************************************************/
/* 函数定义：读取图像帧线程任务                                                           */
/****************************************************************************************/
void InputDataTask();

/****************************************************************************************/
/* 函数定义：检测目标线程任务                                                             */
/****************************************************************************************/
void DetectTask();

/****************************************************************************************/
/* 函数定义：发送结果线程任务                                                             */
/****************************************************************************************/
void OutputDataTask();

/****************************************************************************************/
/* 函数定义：初始化接受数据缓冲                                                            */
/****************************************************************************************/
void InitDataSourceBuffer(FrameDataRingBufferStruct* buffer);

/****************************************************************************************/
/* 函数定义：初始化检测结果缓冲                                                           */
/****************************************************************************************/
void InitResultBuffer(DetectResultRingBufferStruct* buffer);

/****************************************************************************************/
/* 函数定义：在网络环境运行                                                               */
/****************************************************************************************/
void RunOnNetwork();